# Используем официальное изображение Go в качестве базового
FROM golang

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем go.mod и go.sum файлы в контейнер
COPY go.mod go.sum ./

# Загружаем все зависимости. Кэшируется, если go.mod и go.sum не изменяются
RUN go mod download

# Копируем исходный код в контейнер
COPY . .

# Сборка Go-приложения
RUN go build -o main ./cmd

# Открываем порт 8080 для доступа извне
EXPOSE 8080

# Команда для запуска исполняемого файла
CMD ["./main"]
